api/app/controllers/application_controller.rb

    def authorize
      if session[:user_id].present?
        @current_user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]