api/app/controllers/intervention_records_controller.rb

SELECT "intervention_records".* FROM "intervention_records"
---
    def index
        intervention_records = InterventionRecord.all

SELECT "intervention_records".* FROM "intervention_records" WHERE "intervention_records"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def show
        intervention_records= InterventionRecord.find(params[:id])

INSERT INTO "intervention_records" ("title", "description", "latitude", "longitude", "status", "image_url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        intervention_record = InterventionRecord.new(intervention_record_params)
            intervention_record.user = current_user
        if intervention_record.save

SELECT "intervention_records".* FROM "intervention_records" WHERE "intervention_records"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "intervention_records" SET "status" = ?, "updated_at" = ? WHERE "intervention_records"."id" = ?  [["status", 1], ["updated_at", "2023-04-22 09:48:20.217420"], ["id", 7]]
UPDATE "intervention_records" SET "title" = ?, "user_id" = ?, "updated_at" = ? WHERE "intervention_records"."id" = ?  [["title", "Testing Endpoint 3 post"], ["user_id", 3], ["updated_at", "2023-04-22 11:29:18.615472"], ["id", 9]]
---
    def update
        intervention_record = InterventionRecord.find(params[:id])
        if current_user.admin? # check if current user is an admin
          if  intervention_record.update(intervention_record_params)
            render json:  intervention_record
          else
            render json: { errors: intervention_record.errors.full_messages }, status: :unprocessable_entity
          end
        else # if the user is not an admin, disallow update to the status attribute
            intervention_record_params_without_status =  intervention_record_params.except(:status)
          if intervention_record.update(intervention_record_params_without_status)

SELECT "intervention_records".* FROM "intervention_records" WHERE "intervention_records"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "intervention_records" WHERE "intervention_records"."id" = ?  [["id", 8]]
---
      def destroy
        intervention_record = InterventionRecord.find(params[:id])

        if current_user.admin?
          intervention_record.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def authorize_unauthenticated
        @current_user = User.find_by(id: session[:user_id])
        @current_user ||= User.find_by(id: payload["user_id"]) if request.headers["Authorization"].present?