api/app/controllers/intervention_records_controller.rb

  def update
  intervention = InterventionRecord.find_by(id: params[:id])

    # if !current_user
    #   render json: {message: "You must be logged in to peform this action"}
    #   return
    # end
    if !intervention
      render json: {message: "Record not found"}, status: :not_found
      return
    end

    if intervention.update(intervention_record_params)
---
SELECT "intervention_records".* FROM "intervention_records" WHERE "intervention_records"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "intervention_records" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "intervention_records"."id" = ?  [["title", "Intervention 2"], ["description", "testing intervention 2"], ["updated_at", "2023-04-28 14:12:17.517706"], ["id", 7]]

      def destroy
        intervention_record = InterventionRecord.find(params[:id])
---
SELECT "intervention_records".* FROM "intervention_records" WHERE "intervention_records"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]