api/app/controllers/intervention_records_controller.rb

    def destroy
        intervention_record = InterventionRecord.find(params[:id])
        intervention_record.destroy
---
DELETE FROM "intervention_records" WHERE "intervention_records"."id" = ?  [["id", 1]]