api/app/controllers/red_flag_records_controller.rb

UPDATE "red_flag_records" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "red_flag_records"."id" = ?  [["title", "First Redflag test"], ["description", "test 1 update"], ["updated_at", "2023-04-28 13:02:11.047704"], ["id", 6]]
---
  def update
    redflag = RedFlagRecord.find_by(id: params[:id])

    # if !current_user
    #   render json: {message: "You must be logged in to peform this action"}
    #   return
    # end
    if !redflag
      render json: {message: "Record not found"}, status: :not_found
      return
    end

    if redflag.update(red_flag_record_params)