api/app/controllers/red_flag_records_controller.rb

SELECT "red_flag_records".* FROM "red_flag_records"
---
    def index
        red_flag_records = RedFlagRecord.all

SELECT "red_flag_records".* FROM "red_flag_records" WHERE "red_flag_records"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        red_flag_records = RedFlagRecord.find(params[:id])

INSERT INTO "red_flag_records" ("title", "description", "latitude", "longitude", "status", "image_url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    red_flag_record = RedFlagRecord.new(red_flag_record_params)
    if @current_user
      red_flag_record.user = @current_user
    end

    if red_flag_record.save

SELECT "red_flag_records".* FROM "red_flag_records" WHERE "red_flag_records"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "red_flag_records" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "red_flag_records"."id" = ?  [["title", "test 3"], ["description", "test 3"], ["updated_at", "2023-04-29 19:41:59.105828"], ["id", 6]]
---
  def update
    redflag = RedFlagRecord.find_by(id: params[:id])

    if !redflag
      render json: {message: "Record not found"}, status: :not_found
      return
    end

    if redflag.update(red_flag_record_params)

SELECT "red_flag_records".* FROM "red_flag_records" WHERE "red_flag_records"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "red_flag_records" WHERE "red_flag_records"."id" = ?  [["id", 11]]
---
    def destroy
        red_flag_record = RedFlagRecord.find(params[:id])

        if current_user.admin?
            red_flag_record.destroy