api/app/controllers/red_flag_records_controller.rb

INSERT INTO "red_flag_records" ("title", "description", "latitude", "longitude", "status", "image_url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "red_flag_records" SET "user_id" = ?, "updated_at" = ? WHERE "red_flag_records"."id" = ?  [["user_id", 10], ["updated_at", "2023-04-22 10:38:05.395279"], ["id", 10]]
---
    def create
        red_flag_record = RedFlagRecord.create(red_flag_record_params)
        if red_flag_record.save

UPDATE "red_flag_records" SET "title" = ?, "updated_at" = ? WHERE "red_flag_records"."id" = ?  [["title", "NEW TITLE"], ["updated_at", "2023-04-22 08:15:48.491716"], ["id", 6]]
---
    def update
        red_flag_record = RedFlagRecord.find(params[:id])
        if red_flag_record.update(red_flag_record_params)

DELETE FROM "red_flag_records" WHERE "red_flag_records"."id" = ?  [["id", 6]]
---
    def destroy
        red_flag_record = RedFlagRecord.find(params[:id])
        red_flag_record.destroy