api/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "masu@mail.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(username: params[:username]) || User.find_by(email: params[:email])